/* 計算機概論實務-基本練習作業-作業17*/
/* 製作人：郭柏鋒 */
/* 完成時間：2019/05/07 01:15*/ 
#include <stdio.h>　//函示庫 
#include <stdlib.h> //函示庫  
int main(int argc, char *argv[]) {
	int a[5]={0};//宣告data陣列，陣列元素為a[0]~a[4],初始值皆為0 */
	int i=0, min;//min整數變數代表最小值
	printf("計算機概論實務-基礎練習作業-作業17\n");
	printf("製作人：郭柏鋒\n");
	printf("完成時間：2019/05/07 01:15\n");
	printf("-------------------------------------------------\n");  
	printf("             找尋陣列中最小值的程式              \n");
	printf("-------------------------------------------------\n");   
	printf("請連續輸入五個數值：\n");
	for(i=0;i<5;i++)//連續輸入5個整數並存放到a[0]~a[4]
	{
	   printf("第%d筆資料：", i+1 );
	   scanf("%d", &a[i]);
	}
	min=a[0];//假設a[0]為最小值
	for(i=0;i<5;i++)//用迴圈逐一找出a[0]~a[4]的最小值
	{
	  if (min>a[i])	
	  {
		  min=a[i];
	  }
	}
	printf("最小值是：%d\n\n",min); 
	system("PAUSE");	
	return 0;
}
